In [13]:
import pandas as pd

In [14]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

In [15]:
accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [16]:
low = 0
avg = 0
high = 0
for i in accounts['income']: 
    if i < 20000: 
        low += 1
    elif i >= 20000 and i <= 50000: 
        avg += 1
    else: 
        high += 1

In [17]:
df = pd.DataFrame([['Low Salary', low], ['Average Salary', avg], ['High Salary', high]], columns=['category', 'accounts_count'])

In [18]:
df

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3